{
  "Checksum":"Given a string, convert each character in the string into its integer ASCII value, sum them, take the sum modulo 64, add the integer value of the space character, and then convert that integer back into its corresponding character (the checksum character). The program must print Check sum is X, where X is replaced by the correct checksum character.",
  "Collatz Numbers":"Given an integer, find the number of terms in the Collatz (hailstone) sequence starting from that integer.",
  "Compare String Lengths":"Given three strings n1, n2, and n3, return true if length(n1) < length(n2) < length(n3), and false otherwise.",
  "Count Odds":"Given a vector of integers, return the number of integers that are odd, without use of a specific even or odd instruction (but allowing instructions such as mod and quotient)",
  "Digits":"Given an integer, print that integer’s digits each on their own line starting with the least significant digit. A negative integer should have the negative sign printed before the most significant digit.",
  "Double Letters":"Given a string, print the string, doubling every letter character, and tripling every exclamation point. All other non-alphabetic and non-exclamation characters should be printed a single time each",
  "Even Squares":"Given an integer n, print all of the positive even perfect squares less than n on separate lines.",
  "For Loop Index":"Given 3 integer inputs start, end, and step, print the integers in the sequence: n0 = start ni = ni−1 + step for each ni < end, each on their own line.",
  "Grade":"Given 5 integers, the first four represent the lower numeric thresholds for achieving an A, B, C, and D, and will be distinct and in descending order. The fifth represents the student’s numeric grade. The program must print Student has a X grade., where X is A, B, C, D, or F depending on the thresholds and the numeric grade.",
  "Last Index of Zero":"Given a vector of integers, at least one of which is 0, return the index of the last occurrence of 0 in the vector.",
  "Median":"Given 3 integers, print their median.",
  "Mirror Image":"Given two vectors of integers, return true if one vector is the reverse of the other, and false otherwise.",
  "Negative To Zero":"Given a vector of integers, return the vector where all negative integers have been replaced by 0.",
  "Number IO":"Given an integer and a float, print their sum.",
  "Pig Latin":"Given a string containing lowercase words separated by single spaces, print the string with each word translated to pig Latin. Specifically, if a word starts with a vowel, it should have “ay” added to its end; otherwise, the first letter is moved to the end of the word, followed by “ay”.",
  "Replace Space with Newline":"Given a string input, print the string, replacing spaces with newlines. Also, return the integer count of the non-whitespace characters. The input string will not have tabs or newlines.",
  "Scrabble Score":"Given a string of visible ASCII characters, return the Scrabble score for that string. Each letter has a corresponding value according to normal Scrabble rules, and non-letter characters are worth zero.",
  "Small Or Large":"Given an integer n, print “small” if n < 1000 and “large” if n ≥ 2000 (and nothing if 1000 ≤ n < 2000).",
  "Smallest":"Given 4 integers, print the smallest of them.",
  "String Differences":"Given 2 strings (with- out whitespace) as input, find the indices at which the strings have different characters, stopping at the end of the shorter one. For each such index, print a line containing the index as well as the character in each string.",
  "String Lengths Backwards":"Given a vector of strings, print the length of each string in the vector starting with the last and ending with the first.",
  "Sum of Squares":"Given integer n, return the sum of squaring each integer in the range [1, n].",
  "Super Anagrams":"Given strings x and y of lowercase letters, return true if y is a super anagram of x, which is the case if every character in x is in y. To be true, y may contain extra characters, but must have at least as many copies of each character as x does.",
  "Syllables":"Given a string containing symbols, spaces, digits, and lowercase letters, count the number of occurrences of vowels (a, e, i, o, u, y) in the string and print that number as X in The number of syllables is X.",
  "Vector Average":"Given a vector of floats, return the average of those floats. Results are rounded to 4 decimal places.",
  "Vectors Summed":"Given two equal-sized vectors of integers, return a vector of integers that contains the sum of the input vectors at each index.",
  "Wallis Pi":"John Wallis gave the following infinite product that converges to π/4: Given an integer input n, compute an approximation of this product out to n terms. Results are rounded to 5 decimal places.",
  "Word Stats":"Given a file, print the number of words containing n characters for n from 1 to the length of the longest word, in the format. At the end of the output, print a line that gives the number of sentences and line that gives the average sentence length using the form. A word is any string of consecutive non-whitespace characters (including sentence terminators). Every file will contain at least one sentence terminator (period, exclamation point, or question mark). The average sentence length is the number of words in the file divided by the number of sentence terminator characters.",
  "X-Word Lines":"Given an integer X and a string that can contain spaces and newlines, print the string with exactly X words per line. The last line may have fewer than X words."
}